---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraint180DegreeDefaultBend
source: html/1b7145bc-45c2-5132-8524-9f0dd28fce6e.htm
---
# RebarShapeConstraint180DegreeDefaultBend Members

Create a 180-degree bend constraint.